#### Terraform Plan (prod) 📖

<details><summary>Show Plan</summary>

```terraform
aws_ecr_repository.api: Refreshing state... [id=surfaced-art-prod-api]
aws_ecr_repository.migrate: Refreshing state... [id=surfaced-art-prod-migrate]
module.s3_cloudfront.aws_cloudfront_origin_access_control.media: Refreshing state... [id=ELMRFW3FG5ERY]
aws_iam_role.api_gateway_cloudwatch: Refreshing state... [id=surfaced-art-prod-us-east-1-api-gateway-cloudwatch]
aws_ecr_repository.image_processor: Refreshing state... [id=surfaced-art-prod-image-processor]
data.aws_vpc.default: Reading...
module.ses.aws_ses_domain_identity.main: Refreshing state... [id=surfacedart.com]
data.aws_caller_identity.current: Reading...
module.s3_cloudfront.aws_cloudfront_response_headers_policy.security: Refreshing state... [id=de817d6b-3c72-4f8c-8981-61a26e1bb853]
module.ses.aws_ses_configuration_set.main: Refreshing state... [id=surfaced-art-prod]
data.aws_caller_identity.current: Read complete after 0s [id=174497891311]
aws_cloudwatch_log_group.api_gateway: Refreshing state... [id=/aws/apigateway/surfaced-art-prod-api]
module.iam.aws_iam_role.lambda_execution: Refreshing state... [id=surfaced-art-prod-lambda-role]
module.s3_cloudfront.aws_s3_bucket.media: Refreshing state... [id=surfaced-art-prod-media]
aws_sns_topic.platform_alerts: Refreshing state... [id=arn:aws:sns:us-east-1:174497891311:surfaced-art-prod-platform-alerts]
module.cognito.aws_cognito_user_pool.main: Refreshing state... [id=us-east-1_3ShQZFwnD]
module.cognito.data.aws_region.current: Reading...
module.cognito.data.aws_region.current: Read complete after 0s [id=us-east-1]
data.aws_iam_policy_document.ecr_lambda: Reading...
data.aws_iam_policy_document.ecr_lambda: Read complete after 0s [id=3882666715]
module.ses.aws_ses_domain_dkim.main: Refreshing state... [id=surfacedart.com]
module.ses.aws_ses_domain_mail_from.main: Refreshing state... [id=surfacedart.com]
aws_ecr_lifecycle_policy.api: Refreshing state... [id=surfaced-art-prod-api]
aws_ecr_repository_policy.api: Refreshing state... [id=surfaced-art-prod-api]
aws_ecr_repository_policy.image_processor: Refreshing state... [id=surfaced-art-prod-image-processor]
aws_ecr_lifecycle_policy.image_processor: Refreshing state... [id=surfaced-art-prod-image-processor]
aws_ecr_repository_policy.migrate: Refreshing state... [id=surfaced-art-prod-migrate]
aws_ecr_lifecycle_policy.migrate: Refreshing state... [id=surfaced-art-prod-migrate]
module.lambda_api.aws_apigatewayv2_api.main: Refreshing state... [id=xl3aiyolr6]
aws_iam_role_policy_attachment.api_gateway_cloudwatch: Refreshing state... [id=surfaced-art-prod-us-east-1-api-gateway-cloudwatch/arn:aws:iam::aws:policy/service-role/AmazonAPIGatewayPushToCloudWatchLogs]
aws_api_gateway_account.main: Refreshing state... [id=174497891311]
aws_sns_topic_subscription.alert_email: Refreshing state... [id=arn:aws:sns:us-east-1:174497891311:surfaced-art-prod-platform-alerts:ef4da12b-2cb4-4a9e-a16d-42fd6b48b8ca]
data.aws_vpc.default: Read complete after 0s [id=vpc-f169728a]
data.aws_subnets.default: Reading...
module.lambda_migrate.aws_security_group.migrate: Refreshing state... [id=sg-03ca0a35c06bc8d29]
module.lambda_api.aws_security_group.lambda: Refreshing state... [id=sg-0792e8a503facea9f]
module.lambda_api.aws_apigatewayv2_stage.main: Refreshing state... [id=$default]
aws_cloudwatch_metric_alarm.api_gateway_5xx: Refreshing state... [id=surfaced-art-prod-api-gateway-5xx]
module.cognito.aws_cognito_user_pool_domain.main: Refreshing state... [id=surfaced-art-prod]
module.cognito.aws_cognito_identity_provider.google[0]: Refreshing state... [id=us-east-1_3ShQZFwnD:Google]
data.aws_subnets.default: Read complete after 1s [id=us-east-1]
module.rds.aws_db_subnet_group.main: Refreshing state... [id=surfaced-art-prod-db-subnet]
module.iam.aws_iam_role_policy.lambda_vpc: Refreshing state... [id=surfaced-art-prod-lambda-role:surfaced-art-prod-lambda-vpc]
module.iam.aws_iam_role_policy.lambda_ses: Refreshing state... [id=surfaced-art-prod-lambda-role:surfaced-art-prod-lambda-ses]
module.iam.aws_iam_role_policy.lambda_cloudwatch: Refreshing state... [id=surfaced-art-prod-lambda-role:surfaced-art-prod-lambda-cloudwatch]
module.iam.aws_iam_role_policy.lambda_ecr: Refreshing state... [id=surfaced-art-prod-lambda-role:surfaced-art-prod-lambda-ecr]
module.lambda_image_processor.aws_lambda_function.image_processor: Refreshing state... [id=surfaced-art-prod-image-processor]
module.cognito.aws_cognito_user_pool_client.main: Refreshing state... [id=6jpbg8j5esuhd4bsng6kn7bhl9]
module.rds.aws_security_group.rds: Refreshing state... [id=sg-0d2ae07b0c2921952]
module.s3_cloudfront.aws_s3_bucket_public_access_block.media: Refreshing state... [id=surfaced-art-prod-media]
module.s3_cloudfront.aws_s3_bucket_versioning.media: Refreshing state... [id=surfaced-art-prod-media]
module.iam.aws_iam_role_policy.lambda_s3: Refreshing state... [id=surfaced-art-prod-lambda-role:surfaced-art-prod-lambda-s3]
module.s3_cloudfront.aws_s3_bucket_server_side_encryption_configuration.media: Refreshing state... [id=surfaced-art-prod-media]
module.s3_cloudfront.aws_s3_bucket_cors_configuration.media: Refreshing state... [id=surfaced-art-prod-media]
module.s3_cloudfront.aws_cloudfront_distribution.media: Refreshing state... [id=E14KTDS8ML4OZN]
module.lambda_image_processor.aws_lambda_permission.s3_invoke: Refreshing state... [id=AllowS3Invoke]
aws_cloudwatch_log_group.image_processor_lambda: Refreshing state... [id=/aws/lambda/surfaced-art-prod-image-processor]
module.rds.aws_db_instance.main: Refreshing state... [id=db-FZHCNNADTKZWPRTP55IS3XQ67E]
module.lambda_image_processor.aws_s3_bucket_notification.image_upload: Refreshing state... [id=surfaced-art-prod-media]
aws_cloudwatch_metric_alarm.rds_free_storage: Refreshing state... [id=surfaced-art-prod-rds-low-storage]
aws_cloudwatch_metric_alarm.rds_connections: Refreshing state... [id=surfaced-art-prod-rds-connection-count]
module.lambda_migrate.aws_lambda_function.migrate: Refreshing state... [id=surfaced-art-prod-migrate]
module.s3_cloudfront.aws_s3_bucket_policy.media: Refreshing state... [id=surfaced-art-prod-media]
module.lambda_api.aws_lambda_function.api: Refreshing state... [id=surfaced-art-prod-api]
aws_cloudwatch_log_group.migrate_lambda: Refreshing state... [id=/aws/lambda/surfaced-art-prod-migrate]
module.lambda_api.aws_lambda_permission.api_gateway: Refreshing state... [id=AllowAPIGatewayInvoke]
module.lambda_api.aws_apigatewayv2_integration.lambda: Refreshing state... [id=c11fy1p]
aws_cloudwatch_log_group.api_lambda: Refreshing state... [id=/aws/lambda/surfaced-art-prod-api]
aws_cloudwatch_metric_alarm.api_lambda_duration: Refreshing state... [id=surfaced-art-prod-api-lambda-duration-p95]
aws_cloudwatch_dashboard.platform: Refreshing state... [id=surfaced-art-prod-platform]
aws_cloudwatch_metric_alarm.api_lambda_errors: Refreshing state... [id=surfaced-art-prod-api-lambda-errors]
module.lambda_api.aws_apigatewayv2_route.catch_all: Refreshing state... [id=5aeeisj]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_ecr_repository.api will be updated in-place
  ~ resource "aws_ecr_repository" "api" {
        id                   = "surfaced-art-prod-api"
      ~ image_tag_mutability = "MUTABLE" -> "IMMUTABLE"
        name                 = "surfaced-art-prod-api"
        tags                 = {
            "Name" = "surfaced-art-prod-api-ecr"
        }
        # (5 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # aws_ecr_repository.image_processor will be updated in-place
  ~ resource "aws_ecr_repository" "image_processor" {
        id                   = "surfaced-art-prod-image-processor"
      ~ image_tag_mutability = "MUTABLE" -> "IMMUTABLE"
        name                 = "surfaced-art-prod-image-processor"
        tags                 = {
            "Name" = "surfaced-art-prod-image-processor-ecr"
        }
        # (5 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # aws_ecr_repository.migrate will be updated in-place
  ~ resource "aws_ecr_repository" "migrate" {
        id                   = "surfaced-art-prod-migrate"
      ~ image_tag_mutability = "MUTABLE" -> "IMMUTABLE"
        name                 = "surfaced-art-prod-migrate"
        tags                 = {
            "Name" = "surfaced-art-prod-migrate-ecr"
        }
        # (5 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # aws_sns_topic.platform_alerts will be updated in-place
  ~ resource "aws_sns_topic" "platform_alerts" {
        id                                       = "arn:aws:sns:us-east-1:174497891311:surfaced-art-prod-platform-alerts"
      + kms_master_key_id                        = "alias/aws/sns"
        name                                     = "surfaced-art-prod-platform-alerts"
        tags                                     = {
            "Name" = "surfaced-art-prod-platform-alerts"
        }
        # (13 unchanged attributes hidden)
    }

  # aws_sns_topic_subscription.alert_email will be created
  + resource "aws_sns_topic_subscription" "alert_email" {
      + arn                             = (known after apply)
      + confirmation_timeout_in_minutes = 1
      + confirmation_was_authenticated  = (known after apply)
      + endpoint                        = (sensitive value)
      + endpoint_auto_confirms          = false
      + filter_policy_scope             = (known after apply)
      + id                              = (known after apply)
      + owner_id                        = (known after apply)
      + pending_confirmation            = (known after apply)
      + protocol                        = "email"
      + raw_message_delivery            = false
      + region                          = "us-east-1"
      + topic_arn                       = "arn:aws:sns:us-east-1:174497891311:surfaced-art-prod-platform-alerts"
    }

  # module.cognito.aws_cognito_identity_provider.google[0] will be updated in-place
  ~ resource "aws_cognito_identity_provider" "google" {
        id                = "us-east-1_3ShQZFwnD:Google"
      ~ provider_details  = {
          - "attributes_url"                = "https://people.googleapis.com/v1/people/me?personFields=" -> null
          - "attributes_url_add_attributes" = "true" -> null
          - "authorize_url"                 = "https://accounts.google.com/o/oauth2/v2/auth" -> null
          - "oidc_issuer"                   = "https://accounts.google.com" -> null
          - "token_request_method"          = "POST" -> null
          - "token_url"                     = "https://www.googleapis.com/oauth2/v4/token" -> null
            # (3 unchanged elements hidden)
        }
        # (6 unchanged attributes hidden)
    }

Plan: 1 to add, 5 to change, 0 to destroy.

Warning: Deprecated attribute

  on modules/cognito/outputs.tf line 18, in output "domain":
  18:   value       = "https://${aws_cognito_user_pool_domain.main.domain}.auth.${data.aws_region.current.name}.amazoncognito.com"

The attribute "name" is deprecated. Refer to the provider documentation for
details.

(and one more similar warning elsewhere)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...

```

</details>

*Pushed by: @nickcjordan, Action: `pull_request`*